Documents/ESB/ESB_Consumer_0529/003TestSample/SAMPLE_XML_MUST/RewardPoints/RP09_VndrRwdPntsInqRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/RewardPoints/VndrRwdPntsInqRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>RewardPoints</ServiceDomain>  
      <OperationName>VndrRwdPntsInq</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:VndrRwdPntsInqRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>RP09</v11:TxnId>  
        <v11:TxnNo>RP090001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:VndrName>HP</v11:VndrName>  
        <v11:VndrMmbId>AA2468013579</v11:VndrMmbId> 
      </v11:ServiceBody> 
    </v11:VndrRwdPntsInqRq> 
  </soap:Body> 
</soap:Envelope>
